Samplecode-MM32/MM32_IAP_Tool/MM32_m3_IAP_UART-MASTER/2_Device/MM32F103xCxE_o/Include/MM32F103xCxE_o.h
    // __IO uint16_t IC_CLR_RESTART_DET;
    // __IO uint16_t RESERVED28;
    // __IO uint32_t IC_COMP_PARAM_1;
    // __IO uint32_t IC_COMP_VERSION;
    // __IO uint32_t IC_COMP_TYPE;  
} I2C_TypeDef;

/** 
* @brief Independent WATCHDOG
*/

typedef struct
{
  __IO uint32_t KR;
  __IO uint32_t PR;
  __IO uint32_t RLR;
  __IO uint32_t SR;
  __IO uint32_t CTRL;
} IWDG_TypeDef;

/** 
* @brief Power Control
*/

typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CSR;
} PWR_TypeDef;

/** 
* @brief Reset and Clock Control
*/

typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CFGR;
  __IO uint32_t CIR;
  __IO uint32_t AHB3RSTR;
  __IO uint32_t AHB2RSTR;
  __IO uint32_t AHB1RSTR;
  __IO uint32_t APB2RSTR;
  __IO uint32_t APB1RSTR;
  __IO uint32_t AHB3ENR;
  __IO uint32_t AHB2ENR;
  __IO uint32_t AHB1ENR;
  __IO uint32_t APB2ENR;
  __IO uint32_t APB1ENR;
  __IO uint32_t BDCR;
  __IO uint32_t CSR;
  __IO uint32_t SYSCFGR;
} RCC_TypeDef;

/** 
* @brief Real-Time Clock
*/

typedef struct
{
  __IO uint16_t CRH;
  __IO uint16_t RESERVED0;
  __IO uint16_t CRL;
  __IO uint16_t RESERVED1;
  __IO uint16_t PRLH;
  __IO uint16_t RESERVED2;
  __IO uint16_t PRLL;
  __IO uint16_t RESERVED3;
  __IO uint16_t DIVH;
  __IO uint16_t RESERVED4;
  __IO uint16_t DIVL;
  __IO uint16_t RESERVED5;
  __IO uint16_t CNTH;
  __IO uint16_t RESERVED6;
  __IO uint16_t CNTL;
  __IO uint16_t RESERVED7;
  __IO uint16_t ALRH;
  __IO uint16_t RESERVED8;
  __IO uint16_t ALRL;
  __IO uint16_t RESERVED9;
} RTC_TypeDef;


/** 
* @brief Serial Peripheral Interface
*/

#define NSSR    SCSR
#define EXTCTL	EXTSCR
typedef struct
{
  __IO uint32_t TXREG; 		//0
  __IO uint32_t RXREG;		//4
  __IO uint16_t CSTAT;		//8
  __IO uint16_t RESERVED0;
  __IO uint16_t INTSTAT;	//c
  __IO uint16_t RESERVED1;
  __IO uint16_t INTEN;		//10
  __IO uint16_t RESERVED2;
  __IO uint16_t INTCLR;		//14
  __IO uint16_t RESERVED3;
  __IO uint16_t GCTL;	    //18
  __IO uint16_t RESERVED4;
  __IO uint16_t CCTL;		//1c
  __IO uint16_t RESERVED5;
  __IO uint16_t SPBRG;		//20
  __IO uint16_t RESERVED6;
  __IO uint16_t RXDNR;		//24
  __IO uint16_t RESERVED7;
  __IO uint16_t SCSR;		//28
  __IO uint16_t RESERVED8;
  __IO uint16_t EXTSCR;		//2c
  __IO uint16_t RESERVED9;
} SPI_TypeDef;


/** 
* @brief TIM
*/
typedef struct
{
  __IO uint16_t CR1;
  __IO uint16_t RESERVED0;
  __IO uint16_t CR2;
  __IO uint16_t RESERVED1;
  __IO uint16_t SMCR;
  __IO uint16_t RESERVED2;
  __IO uint16_t DIER;
  __IO uint16_t RESERVED3;
  __IO uint16_t SR;
  __IO uint16_t RESERVED4;
  __IO uint16_t EGR;
  __IO uint16_t RESERVED5;
  __IO uint16_t CCMR1;
  __IO uint16_t RESERVED6;
  __IO uint16_t CCMR2;
  __IO uint16_t RESERVED7;
  __IO uint16_t CCER;
  __IO uint16_t RESERVED8;
  __IO uint32_t CNT;	//16->32bit
  __IO uint16_t PSC;
  __IO uint16_t RESERVED10;
  __IO uint32_t ARR;	//16->32bit
  __IO uint16_t RCR;
  __IO uint16_t RESERVED12;
  __IO uint32_t CCR1;	//16->32bit
  __IO uint32_t CCR2;	//16->32bit
  __IO uint32_t CCR3;	//16->32bit
  __IO uint32_t CCR4;	//16->32bit
  __IO uint32_t BDTR;
  __IO uint16_t DCR;
  __IO uint16_t RESERVED18;
  __IO uint16_t DMAR;
  __IO uint16_t RESERVED19;
} TIM_TypeDef;


/** 
* @brief Universal Synchronous Asynchronous Receiver Transmitter
*/
#define RXADDR	RXADD
typedef struct
{
  __IO uint32_t TDR;
  __IO uint32_t RDR;
  __IO uint32_t CSR;
  __IO uint32_t ISR;
  __IO uint32_t IER;
  __IO uint32_t ICR;
  __IO uint32_t GCR;
  __IO uint32_t CCR;
  __IO uint32_t BRR;
  __IO uint32_t FRA;
  __IO uint32_t RXADD;
  __IO uint32_t RXMASK;  
  __IO uint32_t SCR;
} UART_TypeDef;

/** 
* @brief Window WATCHDOG
*/

typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CFR;
  __IO uint32_t SR;
} WWDG_TypeDef;

//???chend:no document,not check
/** 
* @brief QSPI
*/

typedef struct
{
  __IO uint32_t INST_READ;
  __IO uint32_t INST_SET;
  __IO uint32_t SPEC;
  __IO uint32_t CLKGEN;
  __IO uint32_t DATA_ADDR;
  __IO uint32_t ENCRYPT;
  __IO uint32_t CHECKDATA;
  __IO uint32_t DATAPRO;
  __IO uint32_t DATAOPEN;
} QSPI_TypeDef;

/** 
* @brief FSMC
*/
#define SSCONR 	SCONR
#define	SCSLR0	SCSLR0_LOW
#define	SCSLR1	SCSLR1_LOW
#define	SCSLR2	SCSLR2_LOW
#define	SCSLR3	SCSLR3_LOW
#define	SCSLR4	SCSLR4_LOW
#define	SCSLR5	SCSLR5_LOW
#define	SCSLR6	SCSLR6_LOW
#define	SCSLR7	SCSLR7_LOW
typedef struct
{
  __IO uint32_t SSCONR;          //0
	__IO uint32_t STMG0R;        //4
	__IO uint32_t STMG1R;        //8
	__IO uint32_t SCTLR;         //c
	__IO uint32_t SREFR;         //10
	__IO uint32_t SCSLR0_LOW;    //14
	__IO uint32_t SCSLR1_LOW;    //18
	__IO uint32_t SCSLR2_LOW;    //1c
	__IO uint32_t SCSLR3_LOW;    //20
	__IO uint32_t SCSLR4_LOW;    //24
	__IO uint32_t SCSLR5_LOW;    //28
	__IO uint32_t SCSLR6_LOW;    //2c
	__IO uint32_t SCSLR7_LOW;    //30
	__IO uint32_t RESERVED0;     //34
	__IO uint32_t RESERVED1;     //38
	__IO uint32_t RESERVED2;     //3c
	__IO uint32_t RESERVED3;     //40
	__IO uint32_t RESERVED4;     //44
	__IO uint32_t RESERVED5;     //48
	__IO uint32_t RESERVED6;     //4c
	__IO uint32_t RESERVED7;     //50
	__IO uint32_t SMSKR0;        //54
	__IO uint32_t SMSKR1;        //58
	__IO uint32_t SMSKR2;        //5c
	__IO uint32_t SMSKR3;        //60
	__IO uint32_t SMSKR4;        //64
	__IO uint32_t SMSKR5;        //68
	__IO uint32_t SMSKR6;        //6c
	__IO uint32_t SMSKR7;        //70
	__IO uint32_t CSALIAS0_LOW;  //74
	__IO uint32_t CSALIAS1_LOW;  //78
	__IO uint32_t RESERVED8;     //7c
	__IO uint32_t RESERVED9;     //80
	__IO uint32_t CSREMAP0_LOW;  //84
	__IO uint32_t CSREMAP1_LOW;  //88
	__IO uint32_t RESERVED10;    //8c
	__IO uint32_t RESERVED11;    //90
	__IO uint32_t SMTMGR_SET0;   //94
	__IO uint32_t SMTMGR_SET1;   //98
	__IO uint32_t SMTMGR_SET2;   //9c
	__IO uint32_t FLASH_TRPDR;   //a0
	__IO uint32_t SMCTLR;        //a4
	__IO uint32_t RESERVED17;    //a8
	__IO uint32_t EXN_MODE_REG;  //ac
} FSMC_TypeDef;

/** 
* @brief TRNG
*/

typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t SR;
  __IO uint32_t IER;
  __IO uint32_t DR;
  __IO uint32_t NONCE_SEED1;
  __IO uint32_t NONCE_SEED2;
  __IO uint32_t NONCE_SEED3;
  
