Samplecode-MM32/MM32_IAP_Tool/MM32_m3_IAP_UART-MASTER/2_Device/MM32F103xCxE_o/Include/MM32F103xCxE_o.h
} TRNG_TypeDef;

/** 
* @brief AES
*/
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t SR;
  __IO uint32_t DINR;
  __IO uint32_t DOUTR;
  __IO uint32_t KEYR0;
  __IO uint32_t KEYR1;
  __IO uint32_t KEYR2;
  __IO uint32_t KEYR3;
  __IO uint32_t IVR0;
  __IO uint32_t IVR1;
  __IO uint32_t IVR2;
  __IO uint32_t IVR3;
  __IO uint32_t KEYR4;
  __IO uint32_t KEYR5;
  __IO uint32_t KEYR6;
  __IO uint32_t KEYR7;
  
} AES_TypeDef;


/** 
* @brief USB_OTG_FS
*/
typedef struct
{
  __IO uint32_t PER_ID;		  //0x00
  __IO uint32_t ID_COMP;
  __IO uint32_t REV;
  __IO uint32_t ADD_INFO;
  __IO uint32_t OTG_INT_STAT; //0x10
  __IO uint32_t OTG_INT_EN;   //0x14
  __IO uint32_t OTG_STATUS;   //0x18
  __IO uint32_t OTG_CTRL;     //0x1c
  __IO uint32_t RESERVED1;    //0x20
  __IO uint32_t RESERVED2;    //0x24
  __IO uint32_t RESERVED3;    //0x28
  __IO uint32_t RESERVED4;    //0x2c
  __IO uint32_t RESERVED5;    //0x30
  __IO uint32_t RESERVED6;    //0x34
  __IO uint32_t RESERVED7;    //0x38
  __IO uint32_t RESERVED8;    //0x3c
  __IO uint32_t RESERVED9;    //0x40
  __IO uint32_t RESERVED10;    //0x44
  __IO uint32_t RESERVED11;   //0x48
  __IO uint32_t RESERVED12;   //0x4c
  __IO uint32_t RESERVED13;   //0x50
  __IO uint32_t RESERVED14;   //0x54
  __IO uint32_t RESERVED15;   //0x58
  __IO uint32_t RESERVED16;   //0x5c
  __IO uint32_t RESERVED17;   //0x60
  __IO uint32_t RESERVED18;   //0x64
  __IO uint32_t RESERVED19;   //0x68
  __IO uint32_t RESERVED20;   //0x6c
  __IO uint32_t RESERVED21;   //0x70
  __IO uint32_t RESERVED22;   //0x74
  __IO uint32_t RESERVED23;   //0x78
  __IO uint32_t RESERVED24;   //0x7c
  __IO uint32_t INT_STAT;     //0x80
  __IO uint32_t INT_ENB;
  __IO uint32_t ERR_STAT;
  __IO uint32_t ERR_ENB;
  __IO uint32_t STAT;         //0x90
  __IO uint32_t CTL;
  __IO uint32_t ADDR;
  __IO uint32_t BDT_PAGE_01;
  __IO uint32_t FRM_NUML;     //0xa0  
  __IO uint32_t FRM_NUMH;
  __IO uint32_t TOKEN;
  __IO uint32_t SOF_THLD;
  __IO uint32_t BDT_PAGE_02;  //0xb0  
  __IO uint32_t BDT_PAGE_03;  //0xb4 
  __IO uint32_t RESERVED25;   //0xb8
  __IO uint32_t RESERVED26;   //0xbc
  __IO uint32_t EP_CTL0;      //0xc0
  __IO uint32_t EP_CTL1;      //0xc4
  __IO uint32_t EP_CTL2;      //0xc8
  __IO uint32_t EP_CTL3;      //0xcc
  __IO uint32_t EP_CTL4;      //0xd0
  __IO uint32_t EP_CTL5;      //0xd4
  __IO uint32_t EP_CTL6;      //0xd8
  __IO uint32_t EP_CTL7;      //0xdc
  __IO uint32_t EP_CTL8;      //0xe0
  __IO uint32_t EP_CTL9;      //0xe4
  __IO uint32_t EP_CTL10;     //0xe8
  __IO uint32_t EP_CTL11;     //0xec
  __IO uint32_t EP_CTL12;     //0xf0
  __IO uint32_t EP_CTL13;     //0xf4
  __IO uint32_t EP_CTL14;     //0xf8
  __IO uint32_t EP_CTL15;     //0xfc
  
} USB_OTG_FS_TypeDef;

typedef struct
{
    __IO uint32_t FORMAT;
    __IO uint32_t ADRESS;
} BDT_DATA_TypeDef;

typedef struct
{
    BDT_DATA_TypeDef RX_BUF[2];
    BDT_DATA_TypeDef TX_BUF[2];
} USB_OTG_BDT_TypeDef;


/** 
* @brief SDIO
*/

typedef struct
{
  __IO uint32_t MMC_CTRL;   
  __IO uint32_t MMC_IO;   
  __IO uint32_t MMC_BYTECNTL;   
  __IO uint32_t MMC_TR_BLOCKCNT;   
  __IO uint32_t MMC_CRCCTL;   
  __IO uint32_t CMD_CRC;   
  __IO uint32_t DAT_CRCL;   
  __IO uint32_t DAT_CRCH;   
  __IO uint32_t MMC_PORT;   
  __IO uint32_t MMC_INT_MASK;   
  __IO uint32_t CLR_MMC_INT;   
  __IO uint32_t MMC_CARDSEL;   
  __IO uint32_t MMC_SIG;   
  __IO uint32_t MMC_IO_MBCTL;   
  __IO uint32_t MMC_BLOCKCNT;   
  __IO uint32_t MMC_TIMEOUTCNT;   
  __IO uint32_t CMD_BUF0;   
  __IO uint32_t CMD_BUF1;   
  __IO uint32_t CMD_BUF2;   
  __IO uint32_t CMD_BUF3;   
  __IO uint32_t CMD_BUF4;   
  __IO uint32_t CMD_BUF5;   
  __IO uint32_t CMD_BUF6;   
  __IO uint32_t CMD_BUF7;   
  __IO uint32_t CMD_BUF8;   
  __IO uint32_t CMD_BUF9;   
  __IO uint32_t CMD_BUF10;   
  __IO uint32_t CMD_BUF11;   
  __IO uint32_t CMD_BUF12;   
  __IO uint32_t CMD_BUF13;   
  __IO uint32_t CMD_BUF14;   
  __IO uint32_t CMD_BUF15;   
  __IO uint32_t BUF_CTL;  
  __IO uint32_t RESERVED[31];  
  __IO uint32_t DATA_BUF0;  
  __IO uint32_t DATA_BUF1;  
  __IO uint32_t DATA_BUF2;  
  __IO uint32_t DATA_BUF3;  
  __IO uint32_t DATA_BUF4;  
  
} SDIO_TypeDef;


/** 
  * @brief Ethernet MAC
  */
typedef struct
{
	__IO uint32_t MACCR; 					//0X0000
	__IO uint32_t MACFFR;					//0X0004
	__IO uint32_t MACHTHR;				//0X0008
	__IO uint32_t MACHTLR;				//0X000C
	__IO uint32_t MACMIIAR;				//0X0010
	__IO uint32_t MACMIIDR;				//0x0014
	__IO uint32_t MACFCR;					//0x0018
	__IO uint32_t MACVLANTR;			//0x001C
	__IO uint32_t RESERVED0[2];		//0x0020 ~ 0x0024
	__IO uint32_t MACRWUFFR;			//0x0028
	__IO uint32_t MACPMTCSR;  		//0x002C
	//__IO uint32_t MACSR;      	//0x0030
	//__IO uint32_t MACIMR;     	//0x0034
	__IO uint32_t RESERVED1[4];		//0x0030 ~ 0x003C
	__IO uint32_t MACA0HR; 				//0x0040
	__IO uint32_t MACA0LR;      	//0x0044
	__IO uint32_t MACA1HR;      	//0x0048
	__IO uint32_t MACA1LR; 				//0x004C
	__IO uint32_t MACA2HR; 				//0x0050
	__IO uint32_t MACA2LR;      	//0x0054
	__IO uint32_t MACA3HR;      	//0x0058
	__IO uint32_t MACA3LR;      	//0x005C
	__IO uint32_t MACA4HR;      	//0x0060
	__IO uint32_t MACA4LR;      	//0x0064
	__IO uint32_t MACA5HR;      	//0x0068
	__IO uint32_t MACA5LR;      	//0x006C
	__IO uint32_t MACA6HR;      	//0x0070
	__IO uint32_t MACA6LR;      	//0x0074
	__IO uint32_t MACA7HR;      	//0x0078
	__IO uint32_t MACA7LR;      	//0x007C
	__IO uint32_t MACA8HR;      	//0x0080
	__IO uint32_t MACA8LR;      	//0x0084
	__IO uint32_t MACA9HR;      	//0x0088
	__IO uint32_t MACA9LR;      	//0x008C
	__IO uint32_t MACA10HR;     	//0x0090
	__IO uint32_t MACA10LR;     	//0x0094
	__IO uint32_t MACA11HR;     	//0x0098
	__IO uint32_t MACA11LR;     	//0x009C
	__IO uint32_t MACA12HR;     	//0x00A0
	__IO uint32_t MACA12LR;     	//0x00A4
	__IO uint32_t MACA13HR;     	//0x00A8
	__IO uint32_t MACA13LR;     	//0x00AC
	__IO uint32_t MACA14HR;     	//0x00B0
	__IO uint32_t MACA14LR;     	//0x00B4
	__IO uint32_t MACA15HR;     	//0x00B8
	__IO uint32_t MACA15LR;				//0x00BC
	__IO uint32_t MACANCR;				//0x00C0
	__IO uint32_t MACANSR;				//0x00C4
	__IO uint32_t MACANAR;				//0x00C8
	__IO uint32_t MACANLPAR;			//0x00CC
	__IO uint32_t MACANER;				//0x00D0
	__IO uint32_t MACTBIER;				//0x00D4
	__IO uint32_t MACMIISR;				//0x00D8
	__IO uint32_t RESERVED2[9];		//0x00DC ~ 0x00FC
	__IO uint32_t MMCCR;        	//0x0100
	__IO uint32_t MMCRIR;       	//0x0104
	__IO uint32_t MMCTIR;       	//0x0108
	__IO uint32_t MMCRIMR;      	//0x010C
	__IO uint32_t MMCTIMR;      	//0x0110
	__IO uint32_t RESERVED3[14];	//0x0114 ~ 0x0148
	__IO uint32_t MMCTGFSCCR;   	//0x014C
	__IO uint32_t MMCTGFMSCCR;  	//0x0150
	__IO uint32_t RESERVED4[5]; 	//0x0154 ~ 0x0164
	__IO uint32_t MMCTGFCR;     	//0x0168
	__IO uint32_t RESERVED5[10];	//0x016C ~ 0x0190
	__IO uint32_t MMCRFCECR;    	//0x0194
	__IO uint32_t MMCRFAECR;    	//0x0198
	__IO uint32_t RESERVED6[10];	//0x019C ~ 0x01C0
	__IO uint32_t MMCRGUFCR;    	//0x01C4
}ETH_MAC_TypeDef;

/** 
  * @brief Ethernet DMA
  */
typedef struct
{
	__IO uint32_t DMABMR;           //0x1000
	__IO uint32_t DMATPDR;          //0x1004
	__IO uint32_t DMARPDR;          //0x1008
	__IO uint32_t DMARDLAR;         //0x100C
	__IO uint32_t DMATDLAR;         //0x1010
	__IO uint32_t DMASR;            //0x1014
	__IO uint32_t DMAOMR;           //0x1018
	__IO uint32_t DMAIER;           //0x101C
	__IO uint32_t DMAMFBOCR;        //0x1020
	__IO uint32_t RESERVED10[9];    //0x1024 ~ 0x1044
	__IO uint32_t DMACHTDR;         //0x1048
	__IO uint32_t DMACHRDR;         //0x104C
	__IO uint32_t DMACHTBAR;        //0x1050
	__IO uint32_t DMACHRBAR;        //0x1054
} ETH_DMA_TypeDef;



/**
* @}
*/

#define HARD_FAULT_MM         ((HARD_FAULT_TypeDef*)0xE000DE24)

/** @addtogroup Peripheral_memory_map
* @{
*/

