Samplecode-MM32/MM32_IAP_Tool/MM32_m3_IAP_UART-MASTER/2_Device/MM32F103xCxE_o/Include/MM32F103xCxE_o.h
/*******************  Bit definition for GPIO_CRH register  *******************/
#define  GPIO_CRH_MODE                       ((uint32_t)0x33333333)        /*!< Port x mode bits */

#define  GPIO_CRH_MODE8                      ((uint32_t)0x00000003)        /*!< MODE8[1:0] bits (Port x mode bits, pin 8) */
#define  GPIO_CRH_MODE8_0                    ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  GPIO_CRH_MODE8_1                    ((uint32_t)0x00000002)        /*!< Bit 1 */

#define  GPIO_CRH_MODE9                      ((uint32_t)0x00000030)        /*!< MODE9[1:0] bits (Port x mode bits, pin 9) */
#define  GPIO_CRH_MODE9_0                    ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  GPIO_CRH_MODE9_1                    ((uint32_t)0x00000020)        /*!< Bit 1 */

#define  GPIO_CRH_MODE10                     ((uint32_t)0x00000300)        /*!< MODE10[1:0] bits (Port x mode bits, pin 10) */
#define  GPIO_CRH_MODE10_0                   ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  GPIO_CRH_MODE10_1                   ((uint32_t)0x00000200)        /*!< Bit 1 */

#define  GPIO_CRH_MODE11                     ((uint32_t)0x00003000)        /*!< MODE11[1:0] bits (Port x mode bits, pin 11) */
#define  GPIO_CRH_MODE11_0                   ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  GPIO_CRH_MODE11_1                   ((uint32_t)0x00002000)        /*!< Bit 1 */

#define  GPIO_CRH_MODE12                     ((uint32_t)0x00030000)        /*!< MODE12[1:0] bits (Port x mode bits, pin 12) */
#define  GPIO_CRH_MODE12_0                   ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  GPIO_CRH_MODE12_1                   ((uint32_t)0x00020000)        /*!< Bit 1 */

#define  GPIO_CRH_MODE13                     ((uint32_t)0x00300000)        /*!< MODE13[1:0] bits (Port x mode bits, pin 13) */
#define  GPIO_CRH_MODE13_0                   ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  GPIO_CRH_MODE13_1                   ((uint32_t)0x00200000)        /*!< Bit 1 */

#define  GPIO_CRH_MODE14                     ((uint32_t)0x03000000)        /*!< MODE14[1:0] bits (Port x mode bits, pin 14) */
#define  GPIO_CRH_MODE14_0                   ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  GPIO_CRH_MODE14_1                   ((uint32_t)0x02000000)        /*!< Bit 1 */

#define  GPIO_CRH_MODE15                     ((uint32_t)0x30000000)        /*!< MODE15[1:0] bits (Port x mode bits, pin 15) */
#define  GPIO_CRH_MODE15_0                   ((uint32_t)0x10000000)        /*!< Bit 0 */
#define  GPIO_CRH_MODE15_1                   ((uint32_t)0x20000000)        /*!< Bit 1 */

#define  GPIO_CRH_CNF                        ((uint32_t)0xCCCCCCCC)        /*!< Port x configuration bits */

#define  GPIO_CRH_CNF8                       ((uint32_t)0x0000000C)        /*!< CNF8[1:0] bits (Port x configuration bits, pin 8) */
#define  GPIO_CRH_CNF8_0                     ((uint32_t)0x00000004)        /*!< Bit 0 */
#define  GPIO_CRH_CNF8_1                     ((uint32_t)0x00000008)        /*!< Bit 1 */

#define  GPIO_CRH_CNF9                       ((uint32_t)0x000000C0)        /*!< CNF9[1:0] bits (Port x configuration bits, pin 9) */
#define  GPIO_CRH_CNF9_0                     ((uint32_t)0x00000040)        /*!< Bit 0 */
#define  GPIO_CRH_CNF9_1                     ((uint32_t)0x00000080)        /*!< Bit 1 */

#define  GPIO_CRH_CNF10                      ((uint32_t)0x00000C00)        /*!< CNF10[1:0] bits (Port x configuration bits, pin 10) */
#define  GPIO_CRH_CNF10_0                    ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  GPIO_CRH_CNF10_1                    ((uint32_t)0x00000800)        /*!< Bit 1 */

#define  GPIO_CRH_CNF11                      ((uint32_t)0x0000C000)        /*!< CNF11[1:0] bits (Port x configuration bits, pin 11) */
#define  GPIO_CRH_CNF11_0                    ((uint32_t)0x00004000)        /*!< Bit 0 */
#define  GPIO_CRH_CNF11_1                    ((uint32_t)0x00008000)        /*!< Bit 1 */

#define  GPIO_CRH_CNF12                      ((uint32_t)0x000C0000)        /*!< CNF12[1:0] bits (Port x configuration bits, pin 12) */
#define  GPIO_CRH_CNF12_0                    ((uint32_t)0x00040000)        /*!< Bit 0 */
#define  GPIO_CRH_CNF12_1                    ((uint32_t)0x00080000)        /*!< Bit 1 */

#define  GPIO_CRH_CNF13                      ((uint32_t)0x00C00000)        /*!< CNF13[1:0] bits (Port x configuration bits, pin 13) */
#define  GPIO_CRH_CNF13_0                    ((uint32_t)0x00400000)        /*!< Bit 0 */
#define  GPIO_CRH_CNF13_1                    ((uint32_t)0x00800000)        /*!< Bit 1 */

#define  GPIO_CRH_CNF14                      ((uint32_t)0x0C000000)        /*!< CNF14[1:0] bits (Port x configuration bits, pin 14) */
#define  GPIO_CRH_CNF14_0                    ((uint32_t)0x04000000)        /*!< Bit 0 */
#define  GPIO_CRH_CNF14_1                    ((uint32_t)0x08000000)        /*!< Bit 1 */

#define  GPIO_CRH_CNF15                      ((uint32_t)0xC0000000)        /*!< CNF15[1:0] bits (Port x configuration bits, pin 15) */
#define  GPIO_CRH_CNF15_0                    ((uint32_t)0x40000000)        /*!< Bit 0 */
#define  GPIO_CRH_CNF15_1                    ((uint32_t)0x80000000)        /*!< Bit 1 */

/*!<******************  Bit definition for GPIO_IDR register  *******************/
#define  GPIO_IDR_IDR0                       ((uint16_t)0x0001)            /*!< Port input data, bit 0 */
#define  GPIO_IDR_IDR1                       ((uint16_t)0x0002)            /*!< Port input data, bit 1 */
#define  GPIO_IDR_IDR2                       ((uint16_t)0x0004)            /*!< Port input data, bit 2 */
#define  GPIO_IDR_IDR3                       ((uint16_t)0x0008)            /*!< Port input data, bit 3 */
#define  GPIO_IDR_IDR4                       ((uint16_t)0x0010)            /*!< Port input data, bit 4 */
#define  GPIO_IDR_IDR5                       ((uint16_t)0x0020)            /*!< Port input data, bit 5 */
#define  GPIO_IDR_IDR6                       ((uint16_t)0x0040)            /*!< Port input data, bit 6 */
#define  GPIO_IDR_IDR7                       ((uint16_t)0x0080)            /*!< Port input data, bit 7 */
#define  GPIO_IDR_IDR8                       ((uint16_t)0x0100)            /*!< Port input data, bit 8 */
#define  GPIO_IDR_IDR9                       ((uint16_t)0x0200)            /*!< Port input data, bit 9 */
#define  GPIO_IDR_IDR10                      ((uint16_t)0x0400)            /*!< Port input data, bit 10 */
#define  GPIO_IDR_IDR11                      ((uint16_t)0x0800)            /*!< Port input data, bit 11 */
#define  GPIO_IDR_IDR12                      ((uint16_t)0x1000)            /*!< Port input data, bit 12 */
#define  GPIO_IDR_IDR13                      ((uint16_t)0x2000)            /*!< Port input data, bit 13 */
#define  GPIO_IDR_IDR14                      ((uint16_t)0x4000)            /*!< Port input data, bit 14 */
#define  GPIO_IDR_IDR15                      ((uint16_t)0x8000)            /*!< Port input data, bit 15 */

/*******************  Bit definition for GPIO_ODR register  *******************/
#define  GPIO_ODR_ODR0                       ((uint16_t)0x0001)            /*!< Port output data, bit 0 */
#define  GPIO_ODR_ODR1                       ((uint16_t)0x0002)            /*!< Port output data, bit 1 */
#define  GPIO_ODR_ODR2                       ((uint16_t)0x0004)            /*!< Port output data, bit 2 */
#define  GPIO_ODR_ODR3                       ((uint16_t)0x0008)            /*!< Port output data, bit 3 */
#define  GPIO_ODR_ODR4                       ((uint16_t)0x0010)            /*!< Port output data, bit 4 */
#define  GPIO_ODR_ODR5                       ((uint16_t)0x0020)            /*!< Port output data, bit 5 */
#define  GPIO_ODR_ODR6                       ((uint16_t)0x0040)            /*!< Port output data, bit 6 */
#define  GPIO_ODR_ODR7                       ((uint16_t)0x0080)            /*!< Port output data, bit 7 */
#define  GPIO_ODR_ODR8                       ((uint16_t)0x0100)            /*!< Port output data, bit 8 */
#define  GPIO_ODR_ODR9                       ((uint16_t)0x0200)            /*!< Port output data, bit 9 */
#define  GPIO_ODR_ODR10                      ((uint16_t)0x0400)            /*!< Port output data, bit 10 */
#define  GPIO_ODR_ODR11                      ((uint16_t)0x0800)            /*!< Port output data, bit 11 */
#define  GPIO_ODR_ODR12                      ((uint16_t)0x1000)            /*!< Port output data, bit 12 */
#define  GPIO_ODR_ODR13                      ((uint16_t)0x2000)            /*!< Port output data, bit 13 */
#define  GPIO_ODR_ODR14                      ((uint16_t)0x4000)            /*!< Port output data, bit 14 */
#define  GPIO_ODR_ODR15                      ((uint16_t)0x8000)            /*!< Port output data, bit 15 */

/******************  Bit definition for GPIO_BSRR register  *******************/
#define  GPIO_BSRR_BS0                       ((uint32_t)0x00000001)        /*!< Port x Set bit 0 */
#define  GPIO_BSRR_BS1                       ((uint32_t)0x00000002)        /*!< Port x Set bit 1 */
#define  GPIO_BSRR_BS2                       ((uint32_t)0x00000004)        /*!< Port x Set bit 2 */
#define  GPIO_BSRR_BS3                       ((uint32_t)0x00000008)        /*!< Port x Set bit 3 */
#define  GPIO_BSRR_BS4                       ((uint32_t)0x00000010)        /*!< Port x Set bit 4 */
#define  GPIO_BSRR_BS5                       ((uint32_t)0x00000020)        /*!< Port x Set bit 5 */
#define  GPIO_BSRR_BS6                       ((uint32_t)0x00000040)        /*!< Port x Set bit 6 */
#define  GPIO_BSRR_BS7                       ((uint32_t)0x00000080)        /*!< Port x Set bit 7 */
#define  GPIO_BSRR_BS8                       ((uint32_t)0x00000100)        /*!< Port x Set bit 8 */
#define  GPIO_BSRR_BS9                       ((uint32_t)0x00000200)        /*!< Port x Set bit 9 */
#define  GPIO_BSRR_BS10                      ((uint32_t)0x00000400)        /*!< Port x Set bit 10 */
#define  GPIO_BSRR_BS11                      ((uint32_t)0x00000800)        /*!< Port x Set bit 11 */
#define  GPIO_BSRR_BS12                      ((uint32_t)0x00001000)        /*!< Port x Set bit 12 */
#define  GPIO_BSRR_BS13                      ((uint32_t)0x00002000)        /*!< Port x Set bit 13 */
#define  GPIO_BSRR_BS14                      ((uint32_t)0x00004000)        /*!< Port x Set bit 14 */
#define  GPIO_BSRR_BS15                      ((uint32_t)0x00008000)        /*!< Port x Set bit 15 */
                                        
#define  GPIO_BSRR_BR0                       ((uint32_t)0x00010000)        /*!< Port x Reset bit 0 */
#define  GPIO_BSRR_BR1                       ((uint32_t)0x00020000)        /*!< Port x Reset bit 1 */
#define  GPIO_BSRR_BR2                       ((uint32_t)0x00040000)        /*!< Port x Reset bit 2 */
#define  GPIO_BSRR_BR3                       ((uint32_t)0x00080000)        /*!< Port x Reset bit 3 */
#define  GPIO_BSRR_BR4                       ((uint32_t)0x00100000)        /*!< Port x Reset bit 4 */
#define  GPIO_BSRR_BR5                       ((uint32_t)0x00200000)        /*!< Port x Reset bit 5 */
#define  GPIO_BSRR_BR6                       ((uint32_t)0x00400000)        /*!< Port x Reset bit 6 */
#define  GPIO_BSRR_BR7                       ((uint32_t)0x00800000)        /*!< Port x Reset bit 7 */
#define  GPIO_BSRR_BR8                       ((uint32_t)0x01000000)        /*!< Port x Reset bit 8 */
#define  GPIO_BSRR_BR9                       ((uint32_t)0x02000000)        /*!< Port x Reset bit 9 */
#define  GPIO_BSRR_BR10                      ((uint32_t)0x04000000)        /*!< Port x Reset bit 10 */
#define  GPIO_BSRR_BR11                      ((uint32_t)0x08000000)        /*!< Port x Reset bit 11 */
#define  GPIO_BSRR_BR12                      ((uint32_t)0x10000000)        /*!< Port x Reset bit 12 */
#define  GPIO_BSRR_BR13                      ((uint32_t)0x20000000)        /*!< Port x Reset bit 13 */
#define  GPIO_BSRR_BR14                      ((uint32_t)0x40000000)        /*!< Port x Reset bit 14 */
#define  GPIO_BSRR_BR15                      ((uint32_t)0x80000000)        /*!< Port x Reset bit 15 */

/*******************  Bit definition for GPIO_BRR register  *******************/
#define  GPIO_BRR_BR0                        ((uint16_t)0x0001)            /*!< Port x Reset bit 0 */
#define  GPIO_BRR_BR1                        ((uint16_t)0x0002)            /*!< Port x Reset bit 1 */
#define  GPIO_BRR_BR2                        ((uint16_t)0x0004)            /*!< Port x Reset bit 2 */
#define  GPIO_BRR_BR3                        ((uint16_t)0x0008)            /*!< Port x Reset bit 3 */
#define  GPIO_BRR_BR4                        ((uint16_t)0x0010)            /*!< Port x Reset bit 4 */
#define  GPIO_BRR_BR5                        ((uint16_t)0x0020)            /*!< Port x Reset bit 5 */
#define  GPIO_BRR_BR6                        ((uint16_t)0x0040)            /*!< Port x Reset bit 6 */
#define  GPIO_BRR_BR7                        ((uint16_t)0x0080)            /*!< Port x Reset bit 7 */
#define  GPIO_BRR_BR8                        ((uint16_t)0x0100)            /*!< Port x Reset bit 8 */
#define  GPIO_BRR_BR9                        ((uint16_t)0x0200)            /*!< Port x Reset bit 9 */
#define  GPIO_BRR_BR10                       ((uint16_t)0x0400)            /*!< Port x Reset bit 10 */
#define  GPIO_BRR_BR11                       ((uint16_t)0x0800)            /*!< Port x Reset bit 11 */
#define  GPIO_BRR_BR12                       ((uint16_t)0x1000)            /*!< Port x Reset bit 12 */
#define  GPIO_BRR_BR13                       ((uint16_t)0x2000)            /*!< Port x Reset bit 13 */
#define  GPIO_BRR_BR14                       ((uint16_t)0x4000)            /*!< Port x Reset bit 14 */
#define  GPIO_BRR_BR15                       ((uint16_t)0x8000)            /*!< Port x Reset bit 15 */

/******************  Bit definition for GPIO_LCKR register  *******************/
#define  GPIO_LCKR_LCK0                      ((uint32_t)0x00000001)        /*!< Port x Lock bit 0 */
#define  GPIO_LCKR_LCK1                      ((uint32_t)0x00000002)        /*!< Port x Lock bit 1 */
#define  GPIO_LCKR_LCK2                      ((uint32_t)0x00000004)        /*!< Port x Lock bit 2 */
#define  GPIO_LCKR_LCK3                      ((uint32_t)0x00000008)        /*!< Port x Lock bit 3 */
#define  GPIO_LCKR_LCK4                      ((uint32_t)0x00000010)        /*!< Port x Lock bit 4 */
#define  GPIO_LCKR_LCK5                      ((uint32_t)0x00000020)        /*!< Port x Lock bit 5 */
#define  GPIO_LCKR_LCK6                      ((uint32_t)0x00000040)        /*!< Port x Lock bit 6 */
#define  GPIO_LCKR_LCK7                      ((uint32_t)0x00000080)        /*!< Port x Lock bit 7 */
#define  GPIO_LCKR_LCK8                      ((uint32_t)0x00000100)        /*!< Port x Lock bit 8 */
#define  GPIO_LCKR_LCK9                      ((uint32_t)0x00000200)        /*!< Port x Lock bit 9 */
#define  GPIO_LCKR_LCK10                     ((uint32_t)0x00000400)        /*!< Port x Lock bit 10 */
#define  GPIO_LCKR_LCK11                     ((uint32_t)0x00000800)        /*!< Port x Lock bit 11 */
#define  GPIO_LCKR_LCK12                     ((uint32_t)0x00001000)        /*!< Port x Lock bit 12 */
#define  GPIO_LCKR_LCK13                     ((uint32_t)0x00002000)        /*!< Port x Lock bit 13 */
#define  GPIO_LCKR_LCK14                     ((uint32_t)0x00004000)        /*!< Port x Lock bit 14 */
#define  GPIO_LCKR_LCK15                     ((uint32_t)0x00008000)        /*!< Port x Lock bit 15 */
#define  GPIO_LCKR_LCKK                      ((uint32_t)0x00010000)        /*!< Lock key */

