Samplecode-MM32/MM32_IAP_Tool/MM32_m3_IAP_UART-MASTER/2_Device/MM32F103xCxE_o/Include/MM32F103xCxE_o.h
/******************  Bit definition for GPIO_AFRL register  *******************/
#define  GPIO_AFRL_AFR                       ((uint32_t)0xFFFFFFFF)        /*!< Port x alternate function bits */

#define  GPIO_AFRL_AFR0                      ((uint32_t)0x0000000F)        /*!< AFR0[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRL_AFR0_0                    ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  GPIO_AFRL_AFR0_1                    ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  GPIO_AFRL_AFR0_2                    ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  GPIO_AFRL_AFR0_3                    ((uint32_t)0x00000008)        /*!< Bit 3 */

#define  GPIO_AFRL_AFR1                      ((uint32_t)0x000000F0)        /*!< AFR1[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRL_AFR1_0                    ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  GPIO_AFRL_AFR1_1                    ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  GPIO_AFRL_AFR1_2                    ((uint32_t)0x00000040)        /*!< Bit 2 */
#define  GPIO_AFRL_AFR1_3                    ((uint32_t)0x00000080)        /*!< Bit 3 */

#define  GPIO_AFRL_AFR2                      ((uint32_t)0x00000F00)        /*!< AFR2[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRL_AFR2_0                    ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  GPIO_AFRL_AFR2_1                    ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  GPIO_AFRL_AFR2_2                    ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  GPIO_AFRL_AFR2_3                    ((uint32_t)0x00000800)        /*!< Bit 3 */

#define  GPIO_AFRL_AFR3                      ((uint32_t)0x0000F000)        /*!< AFR3[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRL_AFR3_0                    ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  GPIO_AFRL_AFR3_1                    ((uint32_t)0x00002000)        /*!< Bit 1 */
#define  GPIO_AFRL_AFR3_2                    ((uint32_t)0x00004000)        /*!< Bit 2 */
#define  GPIO_AFRL_AFR3_3                    ((uint32_t)0x00008000)        /*!< Bit 3 */

#define  GPIO_AFRL_AFR4                      ((uint32_t)0x000F0000)        /*!< AFR4[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRL_AFR4_0                    ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  GPIO_AFRL_AFR4_1                    ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  GPIO_AFRL_AFR4_2                    ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  GPIO_AFRL_AFR4_3                    ((uint32_t)0x00080000)        /*!< Bit 3 */

#define  GPIO_AFRL_AFR5                      ((uint32_t)0x00F00000)        /*!< AFR5[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRL_AFR5_0                    ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  GPIO_AFRL_AFR5_1                    ((uint32_t)0x00200000)        /*!< Bit 1 */
#define  GPIO_AFRL_AFR5_2                    ((uint32_t)0x00400000)        /*!< Bit 2 */
#define  GPIO_AFRL_AFR5_3                    ((uint32_t)0x00800000)        /*!< Bit 3 */

#define  GPIO_AFRL_AFR6                      ((uint32_t)0x0F000000)        /*!< AFR6[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRL_AFR6_0                    ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  GPIO_AFRL_AFR6_1                    ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  GPIO_AFRL_AFR6_2                    ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  GPIO_AFRL_AFR6_3                    ((uint32_t)0x08000000)        /*!< Bit 3 */

#define  GPIO_AFRL_AFR7                      ((uint32_t)0xF0000000)        /*!< AFR7[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRL_AFR7_0                    ((uint32_t)0x10000000)        /*!< Bit 0 */
#define  GPIO_AFRL_AFR7_1                    ((uint32_t)0x20000000)        /*!< Bit 1 */
#define  GPIO_AFRL_AFR7_2                    ((uint32_t)0x40000000)        /*!< Bit 2 */
#define  GPIO_AFRL_AFR7_3                    ((uint32_t)0x80000000)        /*!< Bit 3 */

/******************  Bit definition for GPIO_AFRH register  *******************/
#define  GPIO_AFRH_AFR                       ((uint32_t)0xFFFFFFFF)        /*!< Port x alternate function bits */
                 
#define  GPIO_AFRH_AFR8                      ((uint32_t)0x0000000F)        /*!< AFR8[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRH_AFR8_0                    ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  GPIO_AFRH_AFR8_1                    ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  GPIO_AFRH_AFR8_2                    ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  GPIO_AFRH_AFR8_3                    ((uint32_t)0x00000008)        /*!< Bit 3 */
                 
#define  GPIO_AFRH_AFR9                      ((uint32_t)0x000000F0)        /*!< AFR9[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRH_AFR9_0                    ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  GPIO_AFRH_AFR9_1                    ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  GPIO_AFRH_AFR9_2                    ((uint32_t)0x00000040)        /*!< Bit 2 */
#define  GPIO_AFRH_AFR9_3                    ((uint32_t)0x00000080)        /*!< Bit 3 */
                 
#define  GPIO_AFRH_AFR10                     ((uint32_t)0x00000F00)        /*!< AFR10[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRH_AFR10_0                   ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  GPIO_AFRH_AFR10_1                   ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  GPIO_AFRH_AFR10_2                   ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  GPIO_AFRH_AFR10_3                   ((uint32_t)0x00000800)        /*!< Bit 3 */
                           
#define  GPIO_AFRH_AFR11                     ((uint32_t)0x0000F000)        /*!< AFR11[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRH_AFR11_0                   ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  GPIO_AFRH_AFR11_1                   ((uint32_t)0x00002000)        /*!< Bit 1 */
#define  GPIO_AFRH_AFR11_2                   ((uint32_t)0x00004000)        /*!< Bit 2 */
#define  GPIO_AFRH_AFR11_3                   ((uint32_t)0x00008000)        /*!< Bit 3 */
                           
