Samplecode-MM32/MM32_IAP_Tool/MM32_m3_IAP_UART-MASTER/2_Device/MM32F103xCxE_o/Include/MM32F103xCxE_o.h
#define  GPIO_AFRH_AFR12                     ((uint32_t)0x000F0000)        /*!< AFR12[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRH_AFR12_0                   ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  GPIO_AFRH_AFR12_1                   ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  GPIO_AFRH_AFR12_2                   ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  GPIO_AFRH_AFR12_3                   ((uint32_t)0x00080000)        /*!< Bit 3 */
                           
#define  GPIO_AFRH_AFR13                     ((uint32_t)0x00F00000)        /*!< AFR13[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRH_AFR13_0                   ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  GPIO_AFRH_AFR13_1                   ((uint32_t)0x00200000)        /*!< Bit 1 */
#define  GPIO_AFRH_AFR13_2                   ((uint32_t)0x00400000)        /*!< Bit 2 */
#define  GPIO_AFRH_AFR13_3                   ((uint32_t)0x00800000)        /*!< Bit 3 */
                           
#define  GPIO_AFRH_AFR14                     ((uint32_t)0x0F000000)        /*!< AFR14[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRH_AFR14_0                   ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  GPIO_AFRH_AFR14_1                   ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  GPIO_AFRH_AFR14_2                   ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  GPIO_AFRH_AFR14_3                   ((uint32_t)0x08000000)        /*!< Bit 3 */
                           
#define  GPIO_AFRH_AFR15                     ((uint32_t)0xF0000000)        /*!< AFR15[3:0] bits (Port x alternate function bits, pin 0) */
#define  GPIO_AFRH_AFR15_0                   ((uint32_t)0x10000000)        /*!< Bit 0 */
#define  GPIO_AFRH_AFR15_1                   ((uint32_t)0x20000000)        /*!< Bit 1 */
#define  GPIO_AFRH_AFR15_2                   ((uint32_t)0x40000000)        /*!< Bit 2 */
#define  GPIO_AFRH_AFR15_3                   ((uint32_t)0x80000000)        /*!< Bit 3 */

/*----------------------------------------------------------------------------*/


/******************************************************************************/
/*                                                                            */
/*                               SystemTick                                   */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for SysTick_CTRL register  *****************/
#define  SysTick_CTRL_ENABLE                 ((uint32_t)0x00000001)        /*!< Counter enable */
#define  SysTick_CTRL_TICKINT                ((uint32_t)0x00000002)        /*!< Counting down to 0 pends the SysTick handler */
#define  SysTick_CTRL_CLKSOURCE              ((uint32_t)0x00000004)        /*!< Clock source */
#define  SysTick_CTRL_COUNTFLAG              ((uint32_t)0x00010000)        /*!< Count Flag */

/*****************  Bit definition for SysTick_LOAD register  *****************/
#define  SysTick_LOAD_RELOAD                 ((uint32_t)0x00FFFFFF)        /*!< Value to load into the SysTick Current Value Register when the counter reaches 0 */

/*****************  Bit definition for SysTick_VAL register  ******************/
#define  SysTick_VAL_CURRENT                 ((uint32_t)0x00FFFFFF)        /*!< Current value at the time the register is accessed */

/*****************  Bit definition for SysTick_CALIB register  ****************/
#define  SysTick_CALIB_TENMS                 ((uint32_t)0x00FFFFFF)        /*!< Reload value to use for 10ms timing */
#define  SysTick_CALIB_SKEW                  ((uint32_t)0x40000000)        /*!< Calibration value is not exactly 10 ms */
#define  SysTick_CALIB_NOREF                 ((uint32_t)0x80000000)        /*!< The reference clock is not provided */

/******************************************************************************/
/*                                                                            */
/*                  Nested Vectored Interrupt Controller                      */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for NVIC_ISER register  *******************/
#define  NVIC_ISER_SETENA                    ((uint32_t)0xFFFFFFFF)        /*!< Interrupt set enable bits */
#define  NVIC_ISER_SETENA_0                  ((uint32_t)0x00000001)        /*!< bit 0 */
#define  NVIC_ISER_SETENA_1                  ((uint32_t)0x00000002)        /*!< bit 1 */
#define  NVIC_ISER_SETENA_2                  ((uint32_t)0x00000004)        /*!< bit 2 */
#define  NVIC_ISER_SETENA_3                  ((uint32_t)0x00000008)        /*!< bit 3 */
#define  NVIC_ISER_SETENA_4                  ((uint32_t)0x00000010)        /*!< bit 4 */
#define  NVIC_ISER_SETENA_5                  ((uint32_t)0x00000020)        /*!< bit 5 */
#define  NVIC_ISER_SETENA_6                  ((uint32_t)0x00000040)        /*!< bit 6 */
#define  NVIC_ISER_SETENA_7                  ((uint32_t)0x00000080)        /*!< bit 7 */
#define  NVIC_ISER_SETENA_8                  ((uint32_t)0x00000100)        /*!< bit 8 */
#define  NVIC_ISER_SETENA_9                  ((uint32_t)0x00000200)        /*!< bit 9 */
#define  NVIC_ISER_SETENA_10                 ((uint32_t)0x00000400)        /*!< bit 10 */
#define  NVIC_ISER_SETENA_11                 ((uint32_t)0x00000800)        /*!< bit 11 */
#define  NVIC_ISER_SETENA_12                 ((uint32_t)0x00001000)        /*!< bit 12 */
#define  NVIC_ISER_SETENA_13                 ((uint32_t)0x00002000)        /*!< bit 13 */
#define  NVIC_ISER_SETENA_14                 ((uint32_t)0x00004000)        /*!< bit 14 */
#define  NVIC_ISER_SETENA_15                 ((uint32_t)0x00008000)        /*!< bit 15 */
#define  NVIC_ISER_SETENA_16                 ((uint32_t)0x00010000)        /*!< bit 16 */
#define  NVIC_ISER_SETENA_17                 ((uint32_t)0x00020000)        /*!< bit 17 */
#define  NVIC_ISER_SETENA_18                 ((uint32_t)0x00040000)        /*!< bit 18 */
#define  NVIC_ISER_SETENA_19                 ((uint32_t)0x00080000)        /*!< bit 19 */
#define  NVIC_ISER_SETENA_20                 ((uint32_t)0x00100000)        /*!< bit 20 */
#define  NVIC_ISER_SETENA_21                 ((uint32_t)0x00200000)        /*!< bit 21 */
#define  NVIC_ISER_SETENA_22                 ((uint32_t)0x00400000)        /*!< bit 22 */
#define  NVIC_ISER_SETENA_23                 ((uint32_t)0x00800000)        /*!< bit 23 */
#define  NVIC_ISER_SETENA_24                 ((uint32_t)0x01000000)        /*!< bit 24 */
#define  NVIC_ISER_SETENA_25                 ((uint32_t)0x02000000)        /*!< bit 25 */
#define  NVIC_ISER_SETENA_26                 ((uint32_t)0x04000000)        /*!< bit 26 */
#define  NVIC_ISER_SETENA_27                 ((uint32_t)0x08000000)        /*!< bit 27 */
#define  NVIC_ISER_SETENA_28                 ((uint32_t)0x10000000)        /*!< bit 28 */
#define  NVIC_ISER_SETENA_29                 ((uint32_t)0x20000000)        /*!< bit 29 */
#define  NVIC_ISER_SETENA_30                 ((uint32_t)0x40000000)        /*!< bit 30 */
#define  NVIC_ISER_SETENA_31                 ((uint32_t)0x80000000)        /*!< bit 31 */

