Samplecode-MM32/MM32_IAP_Tool/MM32_m3_IAP_UART-MASTER/2_Device/MM32F103xCxE_o/Include/MM32F103xCxE_o.h
/*******************  Bit definition for UART_FRA register  *******************/
#define  UART_FRA_DIV_Fraction                  ((uint16_t)0x000F)
#define  UART_FRA_DIV_Fraction_0                ((uint16_t)0x0001)
#define  UART_FRA_DIV_Fraction_1                ((uint16_t)0x0002)
#define  UART_FRA_DIV_Fraction_2                ((uint16_t)0x0004)
#define  UART_FRA_DIV_Fraction_3                ((uint16_t)0x0008)

/*******************  Bit definition for UART_RXADDR register  *******************/
#define  UART_RXADDR_RXADDR                     ((uint16_t)0x00FF)
#define  UART_RXADDR_RXADDR_0                   ((uint16_t)0x0001)
#define  UART_RXADDR_RXADDR_1                   ((uint16_t)0x0002)
#define  UART_RXADDR_RXADDR_2                   ((uint16_t)0x0004)
#define  UART_RXADDR_RXADDR_3                   ((uint16_t)0x0008)
#define  UART_RXADDR_RXADDR_4                   ((uint16_t)0x0010)
#define  UART_RXADDR_RXADDR_5                   ((uint16_t)0x0020)
#define  UART_RXADDR_RXADDR_6                   ((uint16_t)0x0040)
#define  UART_RXADDR_RXADDR_7                   ((uint16_t)0x0080)

/*******************  Bit definition for UART_RXMASK register  *******************/
#define  UART_RXMASK_RXMASK                		((uint16_t)0x00FF)
#define  UART_RXMASK_RXMASK_0              		((uint16_t)0x0001)
#define  UART_RXMASK_RXMASK_1              		((uint16_t)0x0002)
#define  UART_RXMASK_RXMASK_2              		((uint16_t)0x0004)
#define  UART_RXMASK_RXMASK_3              		((uint16_t)0x0008)
#define  UART_RXMASK_RXMASK_4              		((uint16_t)0x0010)
#define  UART_RXMASK_RXMASK_5              		((uint16_t)0x0020)
#define  UART_RXMASK_RXMASK_6              		((uint16_t)0x0040)
#define  UART_RXMASK_RXMASK_7              		((uint16_t)0x0080)

/*******************  Bit definition for UART_SCR register  *******************/
#define  UART_SCR_SCEN	                     ((uint16_t)0x0001)
#define  UART_SCR_SCAEN		                   ((uint16_t)0x0002)
#define  UART_SCR_NACK                       ((uint16_t)0x0004)

#define  UART_SCR_SCFCNT                     ((uint16_t)0x0FF0)
#define  UART_SCR_SCFCNT_0                   ((uint16_t)0x0010)
#define  UART_SCR_SCFCNT_1                   ((uint16_t)0x0020)
#define  UART_SCR_SCFCNT_2                   ((uint16_t)0x0040)
#define  UART_SCR_SCFCNT_3                   ((uint16_t)0x0080)
#define  UART_SCR_SCFCNT_4                   ((uint16_t)0x0100)
#define  UART_SCR_SCFCNT_5                   ((uint16_t)0x0200)
#define  UART_SCR_SCFCNT_6                   ((uint16_t)0x0400)
#define  UART_SCR_SCFCNT_7                   ((uint16_t)0x0800)

#define  UART_SCR_HDSEL                      ((uint16_t)0x1000)

/******************************************************************************/
/*                                                                            */
/*                                 Debug MCU                                  */
/*                                                                            */
/******************************************************************************/

/****************  Bit definition for DBGMCU_IDCODE register  *****************/
#define  DBGMCU_IDCODE_DEV_ID                ((uint32_t)0xFFFFFFFF)        /*!<Device Identifier */


/******************  Bit definition for DBGMCU_CR register  *******************/
#define  DBGMCU_CR_DBG_SLEEP                 ((uint32_t)0x00000001)        /*!<Debug Sleep Mode */
#define  DBGMCU_CR_DBG_STOP                  ((uint32_t)0x00000002)        /*!<Debug Stop Mode */
#define  DBGMCU_CR_DBG_STANDBY               ((uint32_t)0x00000004)        /*!<Debug Standby mode */

#define  DBGMCU_CR_DBG_IWDG_STOP             ((uint32_t)0x00000100)        /*!<Debug Independent Watchdog stopped when Core is halted */
#define  DBGMCU_CR_DBG_WWDG_STOP             ((uint32_t)0x00000200)        /*!<Debug Window Watchdog stopped when Core is halted */
#define  DBGMCU_CR_DBG_TIM1_STOP             ((uint32_t)0x00000400)        /*!<TIM1 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_TIM2_STOP             ((uint32_t)0x00000800)        /*!<TIM2 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_TIM3_STOP             ((uint32_t)0x00001000)        /*!<TIM3 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_TIM4_STOP             ((uint32_t)0x00002000)        /*!<TIM4 counter stopped when core is halted */


/******************************************************************************/
/*                                                                            */
/*                      FLASH and Option Bytes Registers                      */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for FLASH_ACR register  ******************/
#define  FLASH_ACR_LATENCY                   ((uint8_t)0x07)               /*!<LATENCY[2:0] bits (Latency) */
#define  FLASH_ACR_LATENCY_0                 ((uint8_t)0x01)               /*!<Bit 0 */
#define  FLASH_ACR_LATENCY_1                 ((uint8_t)0x02)               /*!<Bit 0 */
#define  FLASH_ACR_LATENCY_2                 ((uint8_t)0x04)               /*!<Bit 1 */

#define  FLASH_ACR_HLFCYA                    ((uint8_t)0x08)               /*!<Flash Half Cycle Access Enable */
#define  FLASH_ACR_PRFTBE                    ((uint8_t)0x10)               /*!<Prefetch Buffer Enable */
#define  FLASH_ACR_PRFTBS                    ((uint8_t)0x20)               /*!<Prefetch Buffer Status */

/******************  Bit definition for FLASH_KEYR register  ******************/
#define  FLASH_KEYR_FKEYR                    ((uint32_t)0xFFFFFFFF)        /*!<FPEC Key */

/*****************  Bit definition for FLASH_OPTKEYR register  ****************/
#define  FLASH_OPTKEYR_OPTKEYR               ((uint32_t)0xFFFFFFFF)        /*!<Option Byte Key */

/******************  Bit definition for FLASH_SR register  *******************/
#define  FLASH_SR_BSY                        ((uint8_t)0x01)               /*!<Busy */
#define  FLASH_SR_PGERR                      ((uint8_t)0x04)               /*!<Programming Error */
#define  FLASH_SR_WRPRTERR                   ((uint8_t)0x10)               /*!<Write Protection Error */
#define  FLASH_SR_EOP                        ((uint8_t)0x20)               /*!<End of operation */

/*******************  Bit definition for FLASH_CR register  *******************/
#define  FLASH_CR_PG                         ((uint16_t)0x0001)            /*!<Programming */
#define  FLASH_CR_PER                        ((uint16_t)0x0002)            /*!<Page Erase */
#define  FLASH_CR_MER                        ((uint16_t)0x0004)            /*!<Mass Erase */
#define  FLASH_CR_OPTPG                      ((uint16_t)0x0010)            /*!<Option Byte Programming */
#define  FLASH_CR_OPTER                      ((uint16_t)0x0020)            /*!<Option Byte Erase */
#define  FLASH_CR_STRT                       ((uint16_t)0x0040)            /*!<Start */
#define  FLASH_CR_LOCK                       ((uint16_t)0x0080)            /*!<Lock */
#define  FLASH_CR_OPTWRE                     ((uint16_t)0x0200)            /*!<Option Bytes Write Enable */
#define  FLASH_CR_ERRIE                      ((uint16_t)0x0400)            /*!<Error Interrupt Enable */
#define  FLASH_CR_EOPIE                      ((uint16_t)0x1000)            /*!<End of operation interrupt enable */
#define  FLASH_CR_EEPWRE                     ((uint16_t)0x1000) 

/*******************  Bit definition for FLASH_AR register  *******************/
#define  FLASH_AR_FAR                        ((uint32_t)0xFFFFFFFF)        /*!<Flash Address */

/******************  Bit definition for FLASH_OBR register  *******************/
#define  FLASH_OBR_OPTERR                    ((uint16_t)0x0001)            /*!<Option Byte Error */

#define  FLASH_OBR_WDG_SW                    ((uint16_t)0x0004)            /*!<WDG_SW */
#define  FLASH_OBR_nRST_STOP                 ((uint16_t)0x0008)            /*!<nRST_STOP */
#define  FLASH_OBR_nRST_STDBY                ((uint16_t)0x0010)            /*!<nRST_STDBY */
#define  FLASH_OBR_neeprom_erase_unlockrdpt  ((uint16_t)0x0020)	

#define	 FLASH_OBR_Data0 										 ((uint32_t)0x0003FC00)
#define	 FLASH_OBR_Data1 										 ((uint32_t)0x03FC0000)

/******************  Bit definition for FLASH_WRP0R register  ******************/
#define  FLASH_WRP0R_WRP                      ((uint32_t)0xFFFFFFFF)        /*!<*/

/******************  Bit definition for FLASH_WRP1R register  ******************/
#define  FLASH_WRP1R_WRP                      ((uint32_t)0xFFFFFFFF)        /*!<*/

