Samplecode-MM32/MM32_IAP_Tool/MM32_m3_IAP_UART-MASTER/2_Device/MM32F103xCxE_o/Include/MM32F103xCxE_o.h
#define  CAN_ECC_DIR							 					 ((uint16_t)0x0020)

#define  CAN_ECC_ERRC												 ((uint16_t)0x00C0)
#define  CAN_ECC_ERRC_0							 				 ((uint16_t)0x0040)
#define  CAN_ECC_ERRC_1							 				 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_EWLR register  *******************/
#define  CAN_EWLR_EWL							 					 ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_RXERR register  *******************/
#define  CAN_RXERR_RXERR						 				 ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_TXERR register  *******************/
#define  CAN_TXERR_TXERR						 				 ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_FF register  *******************/
#define  CAN_SFF_DLC						         	 	 ((uint16_t)0x000F)
#define  CAN_SFF_DLC_0						     			 ((uint16_t)0x0001)
#define  CAN_SFF_DLC_1						     			 ((uint16_t)0x0002)
#define  CAN_SFF_DLC_2						     			 ((uint16_t)0x0004)
#define  CAN_SFF_DLC_3						     			 ((uint16_t)0x0008)

#define  CAN_SFF_RTR						         		 ((uint16_t)0x0040)
#define  CAN_SFF_FF						         			 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_ACR0 register  *******************/
#define  CAN_ACR0_AC                          ((uint16_t)0x00FF)     
#define  CAN_ACR0_AC_0                        ((uint16_t)0x0001)   
#define  CAN_ACR0_AC_1                        ((uint16_t)0x0002) 
#define  CAN_ACR0_AC_2                        ((uint16_t)0x0004)  
#define  CAN_ACR0_AC_3                        ((uint16_t)0x0008)  
#define  CAN_ACR0_AC_4                        ((uint16_t)0x0010)  
#define  CAN_ACR0_AC_5                        ((uint16_t)0x0020)  
#define  CAN_ACR0_AC_6                        ((uint16_t)0x0040) 
#define  CAN_ACR0_AC_7                        ((uint16_t)0x0080)    

/*******************  Bit definition for CAN_ACR1 register  *******************/
#define  CAN_ACR1_AC                          ((uint16_t)0x00FF)     
#define  CAN_ACR1_AC_0                        ((uint16_t)0x0001)   
#define  CAN_ACR1_AC_1                        ((uint16_t)0x0002) 
#define  CAN_ACR1_AC_2                        ((uint16_t)0x0004)  
#define  CAN_ACR1_AC_3                        ((uint16_t)0x0008)  
#define  CAN_ACR1_AC_4                        ((uint16_t)0x0010)  
#define  CAN_ACR1_AC_5                        ((uint16_t)0x0020)  
#define  CAN_ACR1_AC_6                        ((uint16_t)0x0040) 
#define  CAN_ACR1_AC_7                        ((uint16_t)0x0080)   

/*******************  Bit definition for CAN_ACR2 register  *******************/
#define  CAN_ACR2_AC                          ((uint16_t)0x00FF)     
#define  CAN_ACR2_AC_0                        ((uint16_t)0x0001)   
#define  CAN_ACR2_AC_1                        ((uint16_t)0x0002) 
#define  CAN_ACR2_AC_2                        ((uint16_t)0x0004)  
#define  CAN_ACR2_AC_3                        ((uint16_t)0x0008)  
#define  CAN_ACR2_AC_4                        ((uint16_t)0x0010)  
#define  CAN_ACR2_AC_5                        ((uint16_t)0x0020)  
#define  CAN_ACR2_AC_6                        ((uint16_t)0x0040) 
#define  CAN_ACR2_AC_7                        ((uint16_t)0x0080)   

/*******************  Bit definition for CAN_ACR3 register  *******************/
#define  CAN_ACR3_AC                          ((uint16_t)0x00FF)     
#define  CAN_ACR3_AC_0                        ((uint16_t)0x0001)   
#define  CAN_ACR3_AC_1                        ((uint16_t)0x0002) 
#define  CAN_ACR3_AC_2                        ((uint16_t)0x0004)  
#define  CAN_ACR3_AC_3                        ((uint16_t)0x0008)  
#define  CAN_ACR3_AC_4                        ((uint16_t)0x0010)  
#define  CAN_ACR3_AC_5                        ((uint16_t)0x0020)  
#define  CAN_ACR3_AC_6                        ((uint16_t)0x0040) 
#define  CAN_ACR3_AC_7                        ((uint16_t)0x0080)   

/*******************  Bit definition for CAN_AMR0 register  *******************/
#define  CAN_AMR0_AM                          ((uint16_t)0x00FF)     
#define  CAN_AMR0_AM_0                        ((uint16_t)0x0001)   
#define  CAN_AMR0_AM_1                        ((uint16_t)0x0002) 
#define  CAN_AMR0_AM_2                        ((uint16_t)0x0004)  
#define  CAN_AMR0_AM_3                        ((uint16_t)0x0008) 
#define  CAN_AMR0_AM_4                        ((uint16_t)0x0010)  
#define  CAN_AMR0_AM_5                        ((uint16_t)0x0020)  
#define  CAN_AMR0_AM_6                        ((uint16_t)0x0040) 
#define  CAN_AMR0_AM_7                        ((uint16_t)0x0080)  

/*******************  Bit definition for CAN_AMR1 register  *******************/
#define  CAN_AMR1_AM                          ((uint16_t)0x00FF)     
#define  CAN_AMR1_AM_0                        ((uint16_t)0x0001)   
#define  CAN_AMR1_AM_1                        ((uint16_t)0x0002) 
#define  CAN_AMR1_AM_2                        ((uint16_t)0x0004)  
#define  CAN_AMR1_AM_3                        ((uint16_t)0x0008) 
#define  CAN_AMR1_AM_4                        ((uint16_t)0x0010)  
#define  CAN_AMR1_AM_5                        ((uint16_t)0x0020)  
#define  CAN_AMR1_AM_6                        ((uint16_t)0x0040) 
#define  CAN_AMR1_AM_7                        ((uint16_t)0x0080) 

/*******************  Bit definition for CAN_AMR2 register  *******************/
#define  CAN_AMR2_AM                          ((uint16_t)0x00FF)     
#define  CAN_AMR2_AM_0                        ((uint16_t)0x0001)   
#define  CAN_AMR2_AM_1                        ((uint16_t)0x0002) 
#define  CAN_AMR2_AM_2                        ((uint16_t)0x0004)  
#define  CAN_AMR2_AM_3                        ((uint16_t)0x0008) 
#define  CAN_AMR2_AM_4                        ((uint16_t)0x0010)  
#define  CAN_AMR2_AM_5                        ((uint16_t)0x0020)  
#define  CAN_AMR2_AM_6                        ((uint16_t)0x0040) 
#define  CAN_AMR2_AM_7                        ((uint16_t)0x0080) 

/*******************  Bit definition for CAN_AMR3 register  *******************/
#define  CAN_AMR3_AM                          ((uint16_t)0x00FF)     
#define  CAN_AMR3_AM_0                        ((uint16_t)0x0001)   
#define  CAN_AMR3_AM_1                        ((uint16_t)0x0002) 
#define  CAN_AMR3_AM_2                        ((uint16_t)0x0004)  
#define  CAN_AMR3_AM_3                        ((uint16_t)0x0008) 
#define  CAN_AMR3_AM_4                        ((uint16_t)0x0010)  
#define  CAN_AMR3_AM_5                        ((uint16_t)0x0020)  
#define  CAN_AMR3_AM_6                        ((uint16_t)0x0040) 
#define  CAN_AMR3_AM_7                        ((uint16_t)0x0080) 
     
/******************************************************************************/
/*                                                                            */
/*                       Advanced Encryption Standard (AES)                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for AES_CR register  *********************/
#define  AES_CR_EN                           ((uint32_t)0x00000001)        /*!< AES Enable */
#define  AES_CR_DATATYPE                     ((uint32_t)0x00000006)        /*!< Data type selection */
#define  AES_CR_DATATYPE_0                   ((uint32_t)0x00000002)        /*!< Bit 0 */
#define  AES_CR_DATATYPE_1                   ((uint32_t)0x00000004)        /*!< Bit 1 */

#define  AES_CR_MODE                         ((uint32_t)0x00000018)        /*!< AES Mode Of Operation */
#define  AES_CR_MODE_0                       ((uint32_t)0x00000008)        /*!< Bit 0 */
#define  AES_CR_MODE_1                       ((uint32_t)0x00000010)        /*!< Bit 1 */

